ERM/src/Enums/ВидыТранспортаСообщенийОбмена/ВидыТранспортаСообщенийОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТранспортаСообщенийОбмена</name>
  <enumValues>
    <name>EMAIL</name>
  </enumValues>
  <enumValues>
    <name>FILE</name>
  </enumValues>
  <enumValues>
    <name>FTP</name>
  </enumValues>
  <enumValues>
    <name>WS</name>
  </enumValues>
  <enumValues>
    <name>COM</name>
  </enumValues>
</mdclass:Enum>

ERM/src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Организации</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОсновнойДоговорКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеКонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННВведенКорректно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППВведенКорректно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенноеПредставлениеИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенноеПредставлениеКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйОрган</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГосударственногоОргана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГосударственныхОрганов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГосударственногоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеАктивности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияАктивностиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRMID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CRMID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛокальноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreditRating</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CreditRating</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДеактивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлассификатора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеЛокальноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКПП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияНаименований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ERM/src/WebServices/ERMIntegration/Module.bsl
Функция GetClientList(ПараметрыПоиска)
	
	КомпонентыОбмена = ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена("Отправка");
	
	#Область НастройкаКомпонентовОбмена
	УзелДляОбмена = ПланыОбмена.rgsОбменКлиентамиЧерезУниверсальныйФормат.НайтиПоКоду("PS");
	
	КомпонентыОбмена.УзелКорреспондента = УзелДляОбмена;
	
	КомпонентыОбмена.ВерсияФорматаОбмена = ОбменДаннымиXDTOСервер.ВерсияФорматаОбменаПриВыгрузке(УзелДляОбмена);
	
	ФорматОбмена = ОбменДаннымиXDTOСервер.ФорматОбмена(
		УзелДляОбмена, КомпонентыОбмена.ВерсияФорматаОбмена);
	КомпонентыОбмена.XMLСхема = ФорматОбмена;
	
	КомпонентыОбмена.МенеджерОбмена = ОбменДаннымиXDTOСервер.МенеджерОбменаВерсииФормата(
		УзелДляОбмена, КомпонентыОбмена.ВерсияФорматаОбмена);
	
	КомпонентыОбмена.ТаблицаПравилаРегистрацииОбъектов = ОбменДаннымиXDTOСервер.ПравилаРегистрацииОбъектов(УзелДляОбмена);
	КомпонентыОбмена.СвойстваУзлаПланаОбмена = ОбменДаннымиXDTOСервер.СвойстваУзлаПланаОбмена(УзелДляОбмена);
	
	ОбменДаннымиXDTOСервер.ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена);
	#КонецОбласти
	
	#Область ВыгрузкаДанных
	СтруктураВозвратаСпискаКлиентов = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseDataAddition/1.0", "СтруктураВозвратаСпискаКлиентов");
	СписокКлиентовXDTO = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseDataAddition/1.0", "СписокКонтрагентов");
	ТипКлиентаXDTO = ПолучитьТипОбъектаXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", "Справочник.Контрагенты");
	ПравилоКонвертации = КомпонентыОбмена.ПравилаКонвертацииОбъектов.Найти("Справочник_Контрагенты_Отправка", "ИмяПКО");
	
	ВыборкаКлиентов = ПолучитьВыборкуКлиентов(ПараметрыПоиска);
	
	ТекНомерКлиента = 0;
	Пока ВыборкаКлиентов.Следующий() И ТекНомерКлиента <= 100 Цикл
		
		СтруктураXDTO = ОбменДаннымиXDTOСервер.ДанныеXDTOИзДанныхИБ(КомпонентыОбмена, ВыборкаКлиентов.Клиент, ПравилоКонвертации);
		КлиентXDTO = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", "Справочник.Контрагенты");
		СписокКлиентовXDTO.Контрагенты.Добавить(ОбменДаннымиXDTOСервер.ОбъектXDTOИзДанныхXDTO(КомпонентыОбмена, СтруктураXDTO, ТипКлиентаXDTO, КлиентXDTO));
		ТекНомерКлиента = ТекНомерКлиента + 1;
		
	КонецЦикла;
	
	Если ВыборкаКлиентов.Количество() > 100 Тогда
		СтруктураВозвратаСпискаКлиентов.ДопИнформация = "Найдено более 100 элементов. Необходимо уточнить условия запроса.";
	КонецЕсли;
	
	// { RGS VShamin 29.04.2016 14:14:18 - 
	Если ВыборкаКлиентов.Количество() = 0 Тогда
		СтруктураВозвратаСпискаКлиентов.ДопИнформация = "Не найдено ни одного клиента. Необходимо уточнить условия запроса.";
	КонецЕсли;
	// } RGS VShamin 29.04.2016 14:14:18 - 
	
	СтруктураВозвратаСпискаКлиентов.СписокКлиентов = СписокКлиентовXDTO;
	
	Попытка
		СтруктураВозвратаСпискаКлиентов.Проверить();
	Исключение
		СтруктураВозвратаСпискаКлиентов.СообщениеОбОшибке = ОписаниеОшибки();
		СтруктураВозвратаСпискаКлиентов.СписокКлиентов = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseDataAddition/1.0", "СписокКонтрагентов");
	КонецПопытки;
	
	#КонецОбласти
	
	Возврат СтруктураВозвратаСпискаКлиентов;
	
КонецФункции

Функция ПолучитьВыборкуКлиентов(ПараметрыПоиска)
	
	Запрос = Новый Запрос;
	
	ДопУсловие = "";
	Если ЗначениеЗаполнено(ПараметрыПоиска.НаименованиеАнгл) Тогда
		ДопУсловие = ДопУсловие + " И Контрагенты.Наименование ПОДОБНО ""%" + СокрЛП(ПараметрыПоиска.НаименованиеАнгл) + "%""";
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыПоиска.Наименование) Тогда
		ДопУсловие = ДопУсловие + " И Контрагенты.ЛокальноеНаименование ПОДОБНО ""%" + СокрЛП(ПараметрыПоиска.Наименование) + "%""";
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыПоиска.ИНН) Тогда
		ДопУсловие = ДопУсловие + " И Контрагенты.ИНН = """ + СокрЛП(ПараметрыПоиска.ИНН) + """";
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыПоиска.КПП) Тогда
		ДопУсловие = ДопУсловие + " И Контрагенты.КПП = """ + СокрЛП(ПараметрыПоиска.КПП) + """";
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Клиент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления" + ДопУсловие;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

Функция ПолучитьОбъектXDTO(ИспользуемаяФабрикаXDTO, URIПространстваИмен, Имя) 
	
	// Конструирует объект XDTO типа Имя с помощью ФабрикиXDTO и URIПространстваИмен
	
	ТипПоля = ИспользуемаяФабрикаXDTO.Тип(URIПространстваИмен, Имя);
	Возврат ИспользуемаяФабрикаXDTO.Создать(ТипПоля);
	
КонецФункции

Функция ПолучитьТипОбъектаXDTO(ИспользуемаяФабрикаXDTO, URIПространстваИмен, Имя)
	
	Возврат ИспользуемаяФабрикаXDTO.Тип("http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", Имя);
	
КонецФункции

Функция RegisterClients(RefList)
	
	УзелОбмена = ПолучитьУзел(RefList.ИдентификаторКорреспондента);
	
	Для каждого ТекСсылка Из RefList.Ссылки Цикл
		
		ТекКлиент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекСсылка));
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ТекКлиент);
		
		Выборка = Справочники.БанковскиеСчета.Выбрать(,ТекКлиент);
		Пока Выборка.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Выборка.Ссылка);
		КонецЦикла;
		
	КонецЦикла;
	
	// инициируем обмен
	Отказ = Ложь;
	ПараметрыОбмена = Новый Структура();
	ПараметрыОбмена.Вставить("ВидТранспортаСообщенийОбмена", Перечисления.ВидыТранспортаСообщенийОбмена.WS);
	ПараметрыОбмена.Вставить("ВыполнятьЗагрузку", Истина);
	ПараметрыОбмена.Вставить("ВыполнятьВыгрузку", Истина);
	ПараметрыОбмена.Вставить("ТолькоПараметры", Ложь);
	ПараметрыОбмена.Вставить("ПараметрыАутентификации", Неопределено);
	ПараметрыОбмена.Вставить("ИдентификаторФайла", "");
	ПараметрыОбмена.Вставить("ДлительнаяОперация", Ложь);
	ПараметрыОбмена.Вставить("ИдентификаторОперации", "");
	ПараметрыОбмена.Вставить("ДлительнаяОперацияРазрешена", Истина);
	ОбменДаннымиСервер.ВыполнитьОбменДаннымиДляУзлаИнформационнойБазы(УзелОбмена, ПараметрыОбмена, Отказ);
	
	Возврат Отказ;
	
КонецФункции

Функция GetRequestList()
	
	КомпонентыОбмена = ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена("Отправка");
	
	#Область НастройкаКомпонентовОбмена
	УзелДляОбмена = ПланыОбмена.rgsОбменКлиентамиЧерезУниверсальныйФормат.НайтиПоКоду("PS");
	
	КомпонентыОбмена.УзелКорреспондента = УзелДляОбмена;
	
	КомпонентыОбмена.ВерсияФорматаОбмена = ОбменДаннымиXDTOСервер.ВерсияФорматаОбменаПриВыгрузке(УзелДляОбмена);
	
	ФорматОбмена = ОбменДаннымиXDTOСервер.ФорматОбмена(
		УзелДляОбмена, КомпонентыОбмена.ВерсияФорматаОбмена);
	КомпонентыОбмена.XMLСхема = ФорматОбмена;
	
	КомпонентыОбмена.МенеджерОбмена = ОбменДаннымиXDTOСервер.МенеджерОбменаВерсииФормата(
		УзелДляОбмена, КомпонентыОбмена.ВерсияФорматаОбмена);
	
	КомпонентыОбмена.ТаблицаПравилаРегистрацииОбъектов = ОбменДаннымиXDTOСервер.ПравилаРегистрацииОбъектов(УзелДляОбмена);
	КомпонентыОбмена.СвойстваУзлаПланаОбмена = ОбменДаннымиXDTOСервер.СвойстваУзлаПланаОбмена(УзелДляОбмена);
	
	ОбменДаннымиXDTOСервер.ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена);
	#КонецОбласти
	
	#Область ВыгрузкаДанных
	СтруктураВозвратаСпискаЗаявокНаИзменениеКлиентов = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseDataAddition/1.0", "СтруктураВозвратаСпискаЗаявокНаИзменениеКлиентов");
	СписокЗаявокXDTO = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseDataAddition/1.0", "СписокЗаявокНаИзменениеКлиентов");
	ТипЗаявкиXDTO = ПолучитьТипОбъектаXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", "Справочник.ЗаявкаНаИзменениеКлиента");
	ПравилоКонвертации = КомпонентыОбмена.ПравилаКонвертацииОбъектов.Найти("Справочник_ЗаявкаНаИзменениеКлиента_Отправка", "ИмяПКО");
	
	ВыборкаЗаявок = ПолучитьВыборкуЗаявок();
	
	ТекНомерКлиента = 0;
	Пока ВыборкаЗаявок.Следующий() Цикл
		
		СтруктураXDTO = ОбменДаннымиXDTOСервер.ДанныеXDTOИзДанныхИБ(КомпонентыОбмена, ВыборкаЗаявок.Заявка, ПравилоКонвертации);
		ЗаявкаXDTO = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", "Справочник.ЗаявкаНаИзменениеКлиента");
		СписокЗаявокXDTO.Заявки.Добавить(ОбменДаннымиXDTOСервер.ОбъектXDTOИзДанныхXDTO(КомпонентыОбмена, СтруктураXDTO, ТипЗаявкиXDTO, ЗаявкаXDTO));
		ТекНомерКлиента = ТекНомерКлиента + 1;
		
	КонецЦикла;
	
	СтруктураВозвратаСпискаЗаявокНаИзменениеКлиентов.СписокЗаявок = СписокЗаявокXDTO;
	
	Попытка
		СтруктураВозвратаСпискаЗаявокНаИзменениеКлиентов.Проверить();
	Исключение
		СтруктураВозвратаСпискаЗаявокНаИзменениеКлиентов.СообщениеОбОшибке = ОписаниеОшибки();
		СтруктураВозвратаСпискаЗаявокНаИзменениеКлиентов.СписокЗаявок = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseDataAddition/1.0", "СтруктураВозвратаСпискаЗаявокНаИзменениеКлиентов");
	КонецПопытки;
	
	#КонецОбласти
	
	Возврат СтруктураВозвратаСпискаЗаявокНаИзменениеКлиентов;
	
КонецФункции

Функция ПолучитьВыборкуЗаявок()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаИзменениеКлиента.Ссылка КАК Заявка
	|ИЗ
	|	Справочник.ЗаявкаНаИзменениеКлиента КАК ЗаявкаНаИзменениеКлиента";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция GetRequestAttachedFiles(Request)
	
	КомпонентыОбмена = ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена("Отправка");
	
	#Область НастройкаКомпонентовОбмена
	УзелДляОбмена = ПланыОбмена.rgsОбменКлиентамиЧерезУниверсальныйФормат.НайтиПоКоду("PS");
	
	КомпонентыОбмена.УзелКорреспондента = УзелДляОбмена;
	
	КомпонентыОбмена.ВерсияФорматаОбмена = ОбменДаннымиXDTOСервер.ВерсияФорматаОбменаПриВыгрузке(УзелДляОбмена);
	
	ФорматОбмена = ОбменДаннымиXDTOСервер.ФорматОбмена(
		УзелДляОбмена, КомпонентыОбмена.ВерсияФорматаОбмена);
	КомпонентыОбмена.XMLСхема = ФорматОбмена;
	
	КомпонентыОбмена.МенеджерОбмена = ОбменДаннымиXDTOСервер.МенеджерОбменаВерсииФормата(
		УзелДляОбмена, КомпонентыОбмена.ВерсияФорматаОбмена);
	
	КомпонентыОбмена.ТаблицаПравилаРегистрацииОбъектов = ОбменДаннымиXDTOСервер.ПравилаРегистрацииОбъектов(УзелДляОбмена);
	КомпонентыОбмена.СвойстваУзлаПланаОбмена = ОбменДаннымиXDTOСервер.СвойстваУзлаПланаОбмена(УзелДляОбмена);
	
	ОбменДаннымиXDTOСервер.ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена);
	#КонецОбласти
	
	#Область ВыгрузкаДанных
	СтруктураВозвратаПрисоединенныхФайловЗаявок = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseDataAddition/1.0", "СтруктураВозвратаПрисоединенныхФайловЗаявок");
	СписокПрисоединенныхФайловXDTO = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseDataAddition/1.0", "СписокПрисоединенныхФайловЗаявок");
	ТипПрисоединенногоФайлаXDTO = ПолучитьТипОбъектаXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", "Справочник.ЗаявкаНаИзменениеКлиентаПрисоединенныеФайлы");
	ПравилоКонвертации = КомпонентыОбмена.ПравилаКонвертацииОбъектов.Найти("Справочник_ЗаявкаНаИзменениеКлиентаПФ_Отправка", "ИмяПКО");
	
	Заявка = Справочники.ЗаявкаНаИзменениеКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(Request));
	ВыборкаПрисоединенныхФайлов = ПолучитьВыборкуПрисоединенныхФайловЗаявки(Заявка);
	
	Пока ВыборкаПрисоединенныхФайлов.Следующий() Цикл
		
		ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(ВыборкаПрисоединенныхФайлов.ПрисоединенныйФайл);
		СтруктураXDTO = ОбменДаннымиXDTOСервер.ДанныеXDTOИзДанныхИБ(КомпонентыОбмена, ВыборкаПрисоединенныхФайлов.ПрисоединенныйФайл, ПравилоКонвертации);
		СтруктураXDTO.ФайлХранилище = ПолучитьИзВременногоХранилища(ПрисоединенныеФайлы.ПолучитьДанныеФайла(ВыборкаПрисоединенныхФайлов.ПрисоединенныйФайл).СсылкаНаДвоичныеДанныеФайла);
		ПрисоединенныйФайлXDTO = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", "Справочник.ЗаявкаНаИзменениеКлиентаПрисоединенныеФайлы");
		СписокПрисоединенныхФайловXDTO.ПрисоединенныеФайлы.Добавить(ОбменДаннымиXDTOСервер.ОбъектXDTOИзДанныхXDTO(КомпонентыОбмена, СтруктураXDTO, ТипПрисоединенногоФайлаXDTO, ПрисоединенныйФайлXDTO));
		
	КонецЦикла;
	
	СтруктураВозвратаПрисоединенныхФайловЗаявок.СписокПрисоединенныхФайлов = СписокПрисоединенныхФайловXDTO;
	
	Попытка
		СтруктураВозвратаПрисоединенныхФайловЗаявок.Проверить();
	Исключение
		СтруктураВозвратаПрисоединенныхФайловЗаявок.СообщениеОбОшибке = ОписаниеОшибки();
		СтруктураВозвратаПрисоединенныхФайловЗаявок.СписокЗаявок = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseDataAddition/1.0", "СтруктураВозвратаСпискаЗаявокНаИзменениеКлиентов");
	КонецПопытки;
	
	#КонецОбласти
	
	Возврат СтруктураВозвратаПрисоединенныхФайловЗаявок;
	
КонецФункции

Функция ПолучитьВыборкуПрисоединенныхФайловЗаявки(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаИзменениеКлиентаПрисоединенныеФайлы.Ссылка КАК ПрисоединенныйФайл
		|ИЗ
		|	Справочник.ЗаявкаНаИзменениеКлиентаПрисоединенныеФайлы КАК ЗаявкаНаИзменениеКлиентаПрисоединенныеФайлы
		|ГДЕ
		|	ЗаявкаНаИзменениеКлиентаПрисоединенныеФайлы.ВладелецФайла = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

// { RGS VShamin 04.05.2016 13:38:20 - 
Функция CreateRequest(CreationParameter)
	
	ОписаниеОшибки = "";
	КомпонентыОбмена = ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена("Получение");
	
	#Область НастройкаКомпонентовОбмена
	УзелДляОбмена = ПланыОбмена.rgsОбменКлиентамиЧерезУниверсальныйФормат.ПолучитьУзелОбменаПоИдентификаторуКорреспондента(CreationParameter.ИдентификаторКорреспондента);
	КомпонентыОбмена.УзелКорреспондента = УзелДляОбмена;
	КомпонентыОбмена.УзелКорреспондентаОбъект = УзелДляОбмена.ПолучитьОбъект();
	КомпонентыОбмена.ВерсияФорматаОбмена = ОбменДаннымиXDTOСервер.ВерсияФорматаОбменаПриВыгрузке(УзелДляОбмена);
	ФорматОбмена = ОбменДаннымиXDTOСервер.ФорматОбмена(УзелДляОбмена, КомпонентыОбмена.ВерсияФорматаОбмена);
	КомпонентыОбмена.XMLСхема = ФорматОбмена;
	КомпонентыОбмена.МенеджерОбмена = ОбменДаннымиXDTOСервер.МенеджерОбменаВерсииФормата(УзелДляОбмена, КомпонентыОбмена.ВерсияФорматаОбмена);
	ОбменДаннымиXDTOСервер.ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена);
	#КонецОбласти
	ПравилоКонвертацииЗаявкаПолучение = КомпонентыОбмена.ПравилаКонвертацииОбъектов.Найти("Справочник_ЗаявкаНаИзменениеКлиента_Получение", "ИмяПКО");
	
	КлючевыеСвойстваЗаявкаНаИзменениеКлиента = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", "КлючевыеСвойстваЗаявкаНаИзменениеКлиента");
	
	ЗаявкаНаИзменениеКлиента = ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", "Справочник.ЗаявкаНаИзменениеКлиента");
	ЗаявкаНаИзменениеКлиента.КлючевыеСвойства = КлючевыеСвойстваЗаявкаНаИзменениеКлиента;
	ЗаявкаНаИзменениеКлиента.Наименование = CreationParameter.Наименование;
	ЗаявкаНаИзменениеКлиента.ДатаЗаявки = CreationParameter.ДатаЗаявки;
	ЗаявкаНаИзменениеКлиента.ВидОперации = CreationParameter.ВидОперации;
	Если CreationParameter.ВидОперации <> "РегистрацияНовогоОбъекта" Тогда
		ЗаявкаНаИзменениеКлиента.ИзменяемыйКлиент = CreationParameter.ИзменяемыйКлиент;
	КонецЕсли;
	ЗаявкаНаИзменениеКлиента.Инициатор = CreationParameter.Инициатор;
	ЗаявкаНаИзменениеКлиента.СостояниеЗаявки = CreationParameter.СостояниеЗаявки;
	ЗаявкаНаИзменениеКлиента.Комментарий = CreationParameter.Комментарий;
	
	ЗаявкаНаИзменениеКлиентаСтруктураXDTO = ОбменДаннымиXDTOСервер.ОбъектXDTOвСтруктуру(ЗаявкаНаИзменениеКлиента);
	ДанныеИБ = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, ЗаявкаНаИзменениеКлиентаСтруктураXDTO, ПравилоКонвертацииЗаявкаПолучение);
	
	Возврат ОписаниеОшибки;
	
КонецФункции // } RGS VShamin 04.05.2016 13:38:20 - 


Функция ПолучитьУзел(ИдентификаторКорреспондента)
	
	УзелОбмена = ПланыОбмена.rgsОбменКлиентамиЧерезУниверсальныйФормат.ПолучитьУзелОбменаПоИдентификаторуКорреспондента(ИдентификаторКорреспондента);
	
	Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда
		ВызватьИсключение "В базе ERM не настроен узел обмена для синхронизации с текущей базой.";
	КонецЕсли;
	
	Возврат УзелОбмена;
	
КонецФункции
